apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_lowputc.c
/****************************************************************************
 * arch/xtensa/src/esp32s3/esp32s3_lowputc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/irq.h>

#include "chip.h"
#include "xtensa.h"

#include "hardware/esp32s3_pinmap.h"
#include "hardware/esp32s3_system.h"
#include "hardware/esp32s3_uart.h"
#include "hardware/esp32s3_soc.h"

#include "periph_ctrl.h"

#include "esp_clk.h"
#include "esp_gpio.h"

#include "esp32s3_lowputc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Private Types
 ****************************************************************************/

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef HAVE_UART_DEVICE

#ifdef CONFIG_ESP32S3_UART0

struct esp32s3_uart_s g_uart0_config =
{
  .periph = ESP32S3_PERIPH_UART0,
  .id = 0,
  .cpuint = -ENOMEM,
  .irq = ESP32S3_IRQ_UART0,
  .baud = CONFIG_UART0_BAUD,
  .bits = CONFIG_UART0_BITS,
  .parity = CONFIG_UART0_PARITY,
  .stop_b2 = CONFIG_UART0_2STOP,
  .int_pri = ESP32S3_INT_PRIO_DEF,
  .txpin = CONFIG_ESP32S3_UART0_TXPIN,
  .txsig = U0TXD_OUT_IDX,
  .rxpin = CONFIG_ESP32S3_UART0_RXPIN,
  .rxsig = U0RXD_IN_IDX,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rtspin = CONFIG_ESP32S3_UART0_RTSPIN,
  .rtssig = U0RTS_OUT_IDX,
#ifdef CONFIG_UART0_IFLOWCONTROL
  .iflow = true,    /* input flow control (RTS) enabled */
#else
  .iflow = false,   /* input flow control (RTS) disabled */
#endif
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  .ctspin = CONFIG_ESP32S3_UART0_CTSPIN,
  .ctssig = U0CTS_IN_IDX,
#ifdef CONFIG_UART0_OFLOWCONTROL
  .oflow = true,    /* output flow control (CTS) enabled */
#else
  .oflow = false,   /* output flow control (CTS) disabled */
#endif
#endif
#ifdef CONFIG_ESP32S3_UART0_RS485
  .rs485_dir_gpio = CONFIG_ESP32S3_UART0_RS485_DIR_PIN,
#if (CONFIG_ESP32S3_UART0_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#else
  .rs485_dir_polarity = true,
#endif
#endif
};

#endif /* CONFIG_ESP32S3_UART0 */

#ifdef CONFIG_ESP32S3_UART1

struct esp32s3_uart_s g_uart1_config =
{
  .periph = ESP32S3_PERIPH_UART1,
  .id = 1,
  .cpuint = -ENOMEM,
  .irq = ESP32S3_IRQ_UART1,
  .baud = CONFIG_UART1_BAUD,
  .bits = CONFIG_UART1_BITS,
  .parity = CONFIG_UART1_PARITY,
  .stop_b2 = CONFIG_UART1_2STOP,
  .int_pri = ESP32S3_INT_PRIO_DEF,
  .txpin = CONFIG_ESP32S3_UART1_TXPIN,
  .txsig = U1TXD_OUT_IDX,
  .rxpin = CONFIG_ESP32S3_UART1_RXPIN,
  .rxsig = U1RXD_IN_IDX,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rtspin = CONFIG_ESP32S3_UART1_RTSPIN,
  .rtssig = U1RTS_OUT_IDX,
#ifdef CONFIG_UART1_IFLOWCONTROL
  .iflow = true,    /* input flow control (RTS) enabled */
#else
  .iflow = false,   /* input flow control (RTS) disabled */
#endif
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  .ctspin = CONFIG_ESP32S3_UART1_CTSPIN,
  .ctssig = U1CTS_IN_IDX,
#ifdef CONFIG_UART1_OFLOWCONTROL
  .oflow = true,    /* output flow control (CTS) enabled */
#else
  .oflow = false,   /* output flow control (CTS) disabled */
#endif
#endif
#ifdef CONFIG_ESP32S3_UART1_RS485
  .rs485_dir_gpio = CONFIG_ESP32S3_UART1_RS485_DIR_PIN,
#if (CONFIG_ESP32S3_UART1_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#else
  .rs485_dir_polarity = true,
#endif
#endif
};

#endif /* CONFIG_ESP32S3_UART1 */

#ifdef CONFIG_ESP32S3_UART2

struct esp32s3_uart_s g_uart2_config =
{
  .periph = ESP32S3_PERIPH_UART2,
  .id = 2,
  .cpuint = -ENOMEM,
  .irq = ESP32S3_IRQ_UART2,
  .baud = CONFIG_UART2_BAUD,
  .bits = CONFIG_UART2_BITS,
  .parity = CONFIG_UART2_PARITY,
  .stop_b2 = CONFIG_UART2_2STOP,
  .int_pri = ESP32S3_INT_PRIO_DEF,
  .txpin = CONFIG_ESP32S3_UART2_TXPIN,
  .txsig = U2TXD_OUT_IDX,
  .rxpin = CONFIG_ESP32S3_UART2_RXPIN,
  .rxsig = U2RXD_IN_IDX,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rtspin = CONFIG_ESP32S3_UART2_RTSPIN,
  .rtssig = U2RTS_OUT_IDX,
#ifdef CONFIG_UART2_IFLOWCONTROL
  .iflow = true,    /* input flow control (RTS) enabled */
#else
  .iflow = false,   /* input flow control (RTS) disabled */
#endif
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  .ctspin = CONFIG_ESP32S3_UART2_CTSPIN,
  .ctssig = U2CTS_IN_IDX,
#ifdef CONFIG_UART1_OFLOWCONTROL
  .oflow = true,    /* output flow control (CTS) enabled */
#else
  .oflow = false,   /* output flow control (CTS) disabled */
#endif
#endif
#ifdef CONFIG_ESP32S3_UART2_RS485
  .rs485_dir_gpio = CONFIG_ESP32S3_UART2_RS485_DIR_PIN,
#if (CONFIG_ESP32S3_UART2_RS485_DIR_POLARITY == 0)
  .rs485_dir_polarity = false,
#else
  .rs485_dir_polarity = true,
#endif
#endif
};

#endif /* CONFIG_ESP32S3_UART2 */
#endif /* HAVE_UART_DEVICE */

/****************************************************************************
 * Name: uart_is_iomux
 *
 * Description:
 *   Check if the selected UART pins can use IOMUX directly. Otherwise, UART
 *   signals will be routed via GPIO Matrix.
 *
 * Input Parameters:
 *   priv          - Pointer to the private driver struct.
 *
 * Returned Value:
 *   True if can use IOMUX or false if can't.
 *
 ****************************************************************************/

