apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_lowputc.c
  esp_gpiowrite(priv->txpin, true);

  if (uart_is_iomux(priv))
    {
      esp_gpio_matrix_out(priv->txpin, SIG_GPIO_OUT_IDX, 0, 0);
      esp_configgpio(priv->txpin, priv->id == 1 ? OUTPUT_FUNCTION_3 :
                                                      OUTPUT_FUNCTION_1);

      esp_configgpio(priv->rxpin, priv->id == 1 ? INPUT_FUNCTION_3 :
                                                      INPUT_FUNCTION_1);
      esp_gpio_matrix_out(priv->rxpin, SIG_GPIO_OUT_IDX, 0, 0);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          esp_configgpio(priv->rtspin, OUTPUT_FUNCTION_3);
          esp_gpio_matrix_out(priv->rtspin, SIG_GPIO_OUT_IDX, 0, 0);
        }

#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
      if (priv->oflow)
        {
          esp_configgpio(priv->ctspin, INPUT_FUNCTION_3);
          esp_gpio_matrix_out(priv->ctspin, SIG_GPIO_OUT_IDX, 0, 0);
        }
#endif
    }
  else
    {
      esp_gpio_matrix_out(priv->txpin, priv->txsig, 0, 0);
      esp_configgpio(priv->txpin, OUTPUT_FUNCTION_2);

      esp_configgpio(priv->rxpin, INPUT_FUNCTION_2);
      esp_gpio_matrix_in(priv->rxpin, priv->rxsig, 0);

#ifdef CONFIG_SERIAL_IFLOWCONTROL
      if (priv->iflow)
        {
          esp_configgpio(priv->rtspin, OUTPUT_FUNCTION_2);
          esp_gpio_matrix_out(priv->rtspin, priv->rtssig, 0, 0);
        }

#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
      if (priv->oflow)
        {
          esp_configgpio(priv->ctspin, INPUT_FUNCTION_2);
          esp_gpio_matrix_in(priv->ctspin, priv->ctssig, 0);
        }
#endif
    }

#ifdef HAVE_RS485
  if (priv->rs485_dir_gpio != 0)
    {
      esp_configgpio(priv->rs485_dir_gpio, OUTPUT);
      esp_gpio_matrix_out(priv->rs485_dir_gpio, SIG_GPIO_OUT_IDX, 0, 0);
      esp_gpiowrite(priv->rs485_dir_gpio, !priv->rs485_dir_polarity);
    }
#endif
}

/****************************************************************************
 * Name: esp32s3_lowputc_restore_pins
 *
 * Description:
 *   Configure both pins back to INPUT mode and detach the TX pin from the
 *   output signal and the RX pin from the input signal.
 *
 * Parameters:
 *   priv        - Pointer to the private driver struct.
 *
 ****************************************************************************/

void esp32s3_lowputc_restore_pins(const struct esp32s3_uart_s *priv)
{
  /* Configure the pins */

  esp_configgpio(priv->txpin, INPUT);
  esp_gpio_matrix_out(priv->txpin, MATRIX_DETACH_OUT_SIG, false, false);

  esp_configgpio(priv->rxpin, INPUT);
  esp_gpio_matrix_in(priv->rxpin, MATRIX_DETACH_IN_LOW_PIN, false);
}

/****************************************************************************
 * Name: xtensa_lowputc
 *
 * Description:
 *   Output one byte on the serial console.
 *
 * Parameters:
 *   ch        - Byte to be sent.
 *
 ****************************************************************************/

void xtensa_lowputc(char ch)
{
#ifdef CONSOLE_UART

#  if defined(CONFIG_UART0_SERIAL_CONSOLE)
  struct esp32s3_uart_s *priv = &g_uart0_config;
#elif defined (CONFIG_UART1_SERIAL_CONSOLE)
  struct esp32s3_uart_s *priv = &g_uart1_config;
#elif defined (CONFIG_UART2_SERIAL_CONSOLE)
  struct esp32s3_uart_s *priv = &g_uart2_config;
#endif

  /* Wait until the TX FIFO has space to insert new char */

  while (esp32s3_lowputc_is_tx_fifo_full(priv));

  /* Then send the character */

  esp32s3_lowputc_send_byte(priv, ch);
#endif /* CONSOLE_UART */
}

/****************************************************************************
 * Name: esp32s3_lowsetup
 *
 * Description:
 *   This performs only the basic configuration for UART pins.
 *
 ****************************************************************************/

void esp32s3_lowsetup(void)
{
#ifndef CONFIG_SUPPRESS_UART_CONFIG

#ifdef CONFIG_ESP32S3_UART0
  esp32s3_lowputc_enable_sysclk(&g_uart0_config);
  esp32s3_lowputc_config_pins(&g_uart0_config);
#endif

#ifdef CONFIG_ESP32S3_UART1
  esp32s3_lowputc_enable_sysclk(&g_uart1_config);
  esp32s3_lowputc_config_pins(&g_uart1_config);
#endif

#ifdef CONFIG_ESP32S3_UART2
  esp32s3_lowputc_enable_sysclk(&g_uart2_config);
  esp32s3_lowputc_config_pins(&g_uart2_config);
#endif

#endif /* !CONFIG_SUPPRESS_UART_CONFIG */
}
